fix: correct average for sells too, i spend to many time trying to understand whats is wrong with the when i run all tests, but i dont undestand nothing, crying.
